/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 18:33:49 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 18:33:52 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_isprint(int str)
{
	if (32 <= str && str <= 126)
		return (1);
	return (0);
}
/*
Проверяет аргумент, передаваемый через параметр str,
является ли символ печатаемым
*/
/*
#include <stdio.h>
int	main()
{
	printf("1 %d\n", ft_isprint(32));
	printf("1 %d\n", ft_isprint(126));
	printf("0 %d\n", ft_isprint(31));
	printf("0 %d\n", ft_isprint(127));
}
*/