/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 18:26:34 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 18:26:37 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_isdigit(int str)
{
	if (48 <= str && str <= 57)
		return (1);
	return (0);
}
/*
Проверяет аргумент, передаваемый через параметр str,
является ли он числом
*/
/*
#include <stdio.h>
int	main()
{
	printf("1 %d\n", ft_isdigit('0'));
	printf("1 %d\n", ft_isdigit('9'));
	printf("0 %d\n", ft_isdigit('9' + 1));
	printf("0 %d\n", ft_isdigit('0' - 1));
}
*/
