/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 18:33:11 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 18:33:14 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_isascii(int str)
{
	if (0 <= str && str <= 127)
		return (1);
	return (0);
}
/*
Проверяет аргумент, передаваемый через параметр str,
является ли он символом ascii
*/
/*
#include <stdio.h>
int	main()
{
	printf("1 %d\n", ft_isascii(0));
	printf("1 %d\n", ft_isascii(127));
	printf("0 %d\n", ft_isascii(-1));
	printf("0 %d\n", ft_isascii(128));
}
*/