/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 21:15:18 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 21:16:03 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

t_list	*ft_lstlast(t_list *lst)
{
	t_list	*last;

	last = lst;
	if (lst == NULL)
		return (lst);
	while (last->next != NULL)
		last = last->next;
	return (last);
}
/*
Аргументы:
lst: Адрес указателя на начало списка
списка.

Возвращаемое значение:
последняя нода списка

Описание:
Возвращает последнюю ноду списка
*/