/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstiter.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 21:23:44 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 21:24:03 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_lstiter(t_list *lst, void (*f)(void *))
{
	t_list	*iter;

	iter = lst;
	if (lst != NULL && f != NULL)
	{
		while (iter != NULL)
		{
			f(iter->content);
			iter = iter -> next;
		}
	}
}
/*
Аргументы:
lst: Адрес указателя на узел.
f: Адрес функции, используемой для выполнения итерации по списку

Возвращаемое значение: нет

Описание:
Выполняет итерацию списка ’lst’ и применяет функцию
’f’ к содержимому каждого узла.
*/