/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 21:12:55 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 21:13:23 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_lstadd_front(t_list **lst, t_list *new)
{
	new->next = *lst;
	*lst = new;
}
/*
Аргументы:
lst: Адрес указателя на начало списка
списка.
new: Адрес указателя на узел, который должен быть
добавлен в список.

Возвращаемое значение: нет

Описание:
добавляет узел в начало списка.
*/