/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 21:07:31 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 21:09:47 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putendl_fd(char *s, int fd)
{
	ft_putstr_fd(s, fd);
	ft_putchar_fd('\n', fd);
}
/*
Аргументы:
s: Строка для вывода.
fd: Файловый дескриптор, в который выполняется

Возвращаемое значение: нет

Описание:
Выводит строку ’s’ в указанный файловый дескриптор за которой
следует новая строка.
*/