/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 21:10:10 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 21:10:42 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putnbr_fd(int n, int fd)
{
	if (n == -2147483648)
	{
		ft_putchar_fd(45, fd);
		ft_putchar_fd(50, fd);
		ft_putnbr_fd(147483648, fd);
	}
	else if (n < 0)
	{
		n = -1 * n;
		ft_putchar_fd(45, fd);
		ft_putnbr_fd(n, fd);
	}
	else if (n >= 10)
	{
		ft_putnbr_fd(n / 10, fd);
		ft_putnbr_fd(n % 10, fd);
	}
	else
		ft_putchar_fd(n + 48, fd);
}
/*
Аргументы:
s: Целое число для вывода.
fd: Файловый дескриптор, в который выполняется

Возвращаемое значение: нет

Описание:
Выводит целое число ’n’ в указанный файловый дескриптор
*/