/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strtrim.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: defimova <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/21 19:42:00 by defimova          #+#    #+#             */
/*   Updated: 2024/01/21 19:43:45 by defimova         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char	*ft_strtrim(char const *s1, char const *set)
{
	size_t	i;

	if (!s1)
		return (0);
	while (*s1 && ft_strchr(set, *s1))
		s1++;
	i = ft_strlen(s1);
	while (i > 0 && ft_strchr(set, s1[i]))
		i--;
	return (ft_substr(s1, 0, i + 1));
}
/*
Аргументы:
s1 – строка которую нужно обрезать
set - строка набор символов, которые нужно обрезать

Возвращаемое значение:
NULL – если не удалость выделить память
Обрезанная строка

Описание:
Выделяет память и возвращает копию строки s1,
в которой символы set обрезаны в начале и концу строки
*/